[
  {
    "title": "Software Engineer, New Grad (2026 Start)",
    "company_name": "Zip",
    "location": "Toronto, ON",
    "via": "LinkedIn",
    "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=new+grad+2026+tech&htidocid=3433CjucdRjqQEe3AAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_xXNsQ6CMBAA0LgyOjrdqAYpIdFBBydD4oADTi6kwFlq8K7pXQLf4Rery1tf8lkk55qfOtmIcCHnCTGmUOEEZbQ9rIu8OECtNuoGdnDlFgRt7AZggpLZjbg6DapBjsaIjJkTteq7rOO3YcKWZ_PiVv40MvyWMFrFptjncxbIbZcPH8AT3DkyKadwq75LXXXalQAAAA&shmds=v1_AdeF8Kgt4dqa1_Woj0UtmnwB5OY9vhzi9dCHz9eC8tk3t8OcHg&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=new+grad+2026+tech&htidocid=3433CjucdRjqQEe3AAAAAA%3D%3D",
    "thumbnail": "https://serpapi.com/searches/691a67d33d0e4e75e6b8c68f/images/866ad4188f00f88813a35973f8fa7438e814e101e5086094a47461b315d1b130.jpeg",
    "extensions": [
      "21 days ago",
      "Full-time"
    ],
    "detected_extensions": {
      "posted_at": "21 days ago",
      "schedule_type": "Full-time"
    },
    "description": "The simple task of buying software, services, or tools at work has become hopelessly complicated at even the most innovative companies in the world. Today, enterprises spend $120T+ per year globally (>30 times larger than annual consumer e-commerce spend) and rely on vendors more than ever before to run their businesses.\n\nOur cofounders started Zip in 2020 to address this seemingly intractable problem with a purpose-built procurement platform that provides a simple, consumer-grade user experience. Within the last 4 years, Zip has created a new category and developed the leading solution in this $50B+ TAM space. Today, the world’s leading companies like OpenAI, Snowflake, Anthropic, Coinbase, and Prudential rely on Zip to manage billions of dollars in spend.\n\nWe have a world-class team coming from category-defining companies like Airbnb, Meta, Stripe, Salesforce, Apple, and Google. With a $2.2 billion valuation and $370 million in funding from Y Combinator, Tiger Global, BOND, DST Global, and CRV, we’re focused on developing cutting-edge technology, expanding into new global markets, and—above all–driving incredible value for our customers. Join us!\n\nYour Role\n\nAs a Software Engineer you will be responsible for building Zip’s core products and architecture. You will ship features that will be immediately used by our customers, and will work with a tight-knit team that values open communication and cross-functional collaboration. We move quickly to solve a wide range of complex technical and product challenges. While we are an experienced team that can provide constant guidance and mentorship, we value engineers who can scope and solve difficult technical challenges.\n\nYou Will\n• Design and build highly reliable and resilient products and features\n• Work closely with cross functional product and customer-facing teams to understand requirements and ship thoughtful solutions\n• Write high-quality, extensible, and maintainable code\n• Design and build scalable frontend applications and components\n• Design and build APIs to drive existing and new features for a web-based application\n\nQualifications\n• Pursuing a BS or MS in Computer Science or related technical field involving coding (e.g. physics or math), with a graduation date between December 2025 - June 2026\n• Experience with web applications and API development. At Zip, our stack includes Python, Javascript/TypeScript, React, and GraphQL\n• Ability and interest to quickly learn new frameworks, architecture patterns, and programming languages as needed\n• Fantastic written and verbal communication skills\n• Prior internships in high-growth startup environment\n\nPerks & Benefits\n\nAt Zip, we’re committed to providing our employees with everything they need to do their best work.\n• 📈 Start-up equity\n• 🦷 Health, vision & dental coverage\n• 🍽️ Catered lunches & dinners\n• 🚍 Commuter benefit\n• 🚠 Team building events & happy hours\n• 🌴 Flexible PTO\n• 💻 Apple equipment plus home office budget\n\nWe're looking to hire Zipsters and that means hiring people who take ownership, communicate openly, have an underdog mindset, and are excited to increase the pace of innovation for every business in the world. We encourage all candidates to apply even if your experience doesn't exactly match up to our job description. We are committed to building a diverse and inclusive workspace where everyone (regardless of age, religion, ethnicity, gender, sexual orientation, and more) feels like they belong. We look forward to hearing from you!",
    "apply_options": [
      {
        "title": "LinkedIn",
        "link": "https://ca.linkedin.com/jobs/view/software-engineer-new-grad-2026-start-at-zip-4289396950?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "ZipRecruiter",
        "link": "https://www.ziprecruiter.com/c/Zip/Job/Software-Engineer,-New-Grad-(2026-Start)/-in-Toronto,ON?jid=8dd2504e4e9a526e&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "ITjobs.ca",
        "link": "https://www.itjobs.ca/job/8d7e48f2-fe5d-4f9c-aee2-4b276db7a42f?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "BeBee CA",
        "link": "https://ca.bebee.com/job/be5b58b4bc181b67ad64ce3398804757?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Jobs Trabajo.org",
        "link": "https://ca.trabajo.org/job-3804-a0b0b07997999dc83d3d40c7f5196d1d?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "SV Angel Job Board",
        "link": "https://jobs.svangel.com/companies/zip/jobs/57088169-software-engineer-new-grad-2026-start?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Alkeon Capital Job Board - Alkeon Capital Management",
        "link": "https://jobs.alkeon.com/companies/zip/jobs/57088169-software-engineer-new-grad-2026-start?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      }
    ],
    "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciwgTmV3IEdyYWQgKDIwMjYgU3RhcnQpIiwiY29tcGFueV9uYW1lIjoiWmlwIiwiYWRkcmVzc19jaXR5IjoiVG9yb250bywgT04iLCJodGlkb2NpZCI6IjM0MzNDanVjZFJqcVFFZTNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lXVkc5eWIyNTBieXhQYm5SaGNtbHZMRU5oYm1Ga1lRIiwiZ2wiOiJjYSIsImhsIjoiZW4ifQ=="
  },
  {
    "title": "Associate Software Engineer - Seeking 2025 & 2026 Grads",
    "company_name": "Veeva Systems",
    "location": "Toronto, ON",
    "via": "Indeed",
    "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=new+grad+2026+tech&htidocid=YXVmqAZL06idQKGHAAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_xWNMQ6CQBAAY8sTjMVWFkY5QoKFVhaGxAILjC05cD1OYZfcbhTf5CfFZqaYYqLvLCoOItx4qwgl3_VtA8KRnCfEABsoEZ-eHKRJmsHyry3kwd5kaieuQdCGpgUmyJldh_N9qzrIzhiRLnaiVn0TN9wbJqx5NA-u5Y9K2mk1dNO4SrNkjAdyq8UV8WWh_IhiL-AJLhyYlNdwLn6iC_MGrgAAAA&shmds=v1_AdeF8KiIQK7o_QaYzLKNVPb_KHHQKUlj1mY84wHMk_qbppBSiA&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=new+grad+2026+tech&htidocid=YXVmqAZL06idQKGHAAAAAA%3D%3D",
    "thumbnail": "https://serpapi.com/searches/691a67d33d0e4e75e6b8c68f/images/866ad4188f00f8888a4170d2ad59cdf26825d66d63cd93dcafc1afb89138ef49.jpeg",
    "extensions": [
      "$125K a year",
      "Full-time"
    ],
    "detected_extensions": {
      "salary": "$125K a year",
      "schedule_type": "Full-time"
    },
    "description": "Team: Recent University Graduates\n\nCity: Toronto\n\nCountry: Canada\n\nVeeva Systems is building the industry cloud for Life Sciences to help companies work in a more efficient and connected way. Learn more about our products, vision and values, and status as a public benefit corporation on our website.\n\nThe Role\n\nWe are hiring recent university graduates to grow the next generation of Software Engineers through our Engineering Development Program.\n\nWe believe in pushing high potential people to achieve excellence. Our program is specifically designed to provide a challenging environment to learn quickly and deliver value early, equipping you with the resources to become an excellent engineer.\n\nREQUIREMENTS | We are looking for graduates who meet the following requirements:\n• Bachelor’s degree in computer science or related field from an accredited 4 year university with a 3.0 to 4.0 GPA\n• Must have taken relevant C.S. classes, including at least one Compilers or Operating Systems class. The Fundamentals are important at Veeva\n• High work ethic. Veeva is a hard-working company\n• High integrity and honesty. Veeva is a PBC and a “do the right thing” company. We expect that from all employees\n• Excellent verbal and written English communication skills. Engineering is not all about the code, it’s also about communication\n• 0-2 years of professional software experience. We have other jobs for more experienced hires, but EDP is designed for those just getting going in their careers\n• Ability and desire to work in office 4 days/week for your first two years. After 2 years, you will have the flexibility to Work Anywhere\n\nOUR TECHNOLOGY | We have a variety of different products and codebases, but in general, we use this tech stack:\n• System software is Java or Rust\n• Application logic is Java, Python, TypeScript\n• Front end is JavaScript, React, TypeScript\n• Mobile is Swift, Kotlin, React Native\n\nTHE PROCESS | Our process is different than most. It is designed to be fast, efficient and respectful. Here are the steps:\n• You submit your resume, short cover letter of questions, and take a personality test\n• Within one week we will notify you via email if we would like to go to the next step or not\n• The next step is a single 2-hour interview with a member of our tech evaluation team. Part of this is a coding exercise in the language of your choice (Java, JavaScript or Python)\n• Within one week after this step, we will give you an offer, or let you know that we do not wish to move forward\n• You will have two weeks to accept our offer or not. If you accept, we will hold a spot for you and expect you to show up on your start date. Accepting an offer and continuing to interview would be an ethical violation in our view\n• When you join you will be assigned to an engineering manager in your work location. It’s important to know you are applying to work as an engineer in a location but not applying for a specific team/product\n\nCompensation\n• Starting base pay (Cash + RSU): $125,000 CAD in Toronto\n• Starting bonus of $20,000 and annual stock options which can be quite valuable if Veeva stock does well over the long term\n\nWork Authorization: Qualified candidates must be legally authorized to work in Canada. Veeva does not provide sponsorship for employment visa status for this position.\n\nWork Environment: Veeva is a Work Anywhere company. You can choose to work in an office or remotely from home on any given day of the week. Although Veeva is Work from Anywhere, Associate Software Engineers must live within a maximum commuting distance of 45 minutes to 1 hour from their home office and must work in-office 4 days a week.\n\n#LI-Entry\n\nVeeva is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, sex, sexual orientation, gender identity or expression, religion, national origin or ancestry, age, disability, marital status, pregnancy, protected veteran status, protected genetic information, political affiliation, or any other characteristics protected by local laws, regulations, or ordinances. If you need assistance or accommodation due to a disability or special need when applying for a role or in our recruitment process, please contact us at talent_accommodations@veeva.com.",
    "apply_options": [
      {
        "title": "Indeed",
        "link": "https://ca.indeed.com/viewjob?jk=cfbad426ae8c8e3b&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Glassdoor",
        "link": "https://www.glassdoor.ca/job-listing/associate-software-engineer-seeking-2025-2026-grads-veeva-systems-JV_IC2281069_KO0,51_KE52,65.htm?jl=1009856459717&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      }
    ],
    "job_id": "eyJqb2JfdGl0bGUiOiJBc3NvY2lhdGUgU29mdHdhcmUgRW5naW5lZXIgLSBTZWVraW5nIDIwMjUgXHUwMDI2IDIwMjYgR3JhZHMiLCJjb21wYW55X25hbWUiOiJWZWV2YSBTeXN0ZW1zIiwiYWRkcmVzc19jaXR5IjoiVG9yb250bywgT04iLCJodGlkb2NpZCI6IllYVm1xQVpMMDZpZFFLR0hBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lXVkc5eWIyNTBieXhQYm5SaGNtbHZMRU5oYm1Ga1lRIiwiZ2wiOiJjYSIsImhsIjoiZW4ifQ=="
  },
  {
    "title": "Software Developer Entry Level (Spring 2026 Graduate Program)",
    "company_name": "BrainStation",
    "location": "Toronto, ON",
    "via": "Wellfound",
    "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=new+grad+2026+tech&htidocid=H7fv5djS5ElU1OiJAAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_xWNMQrCQBBFsc0RtJlSRZMQ0EI7UQIiKiS9bOK4WdnMLLOrxlt5RJPmwyve-9FvFJUFP8JHCcIe32jZocCBgnzhNDBMCyeGNGRptoZc1P2lAsJVWItqZ7CEI1fgUUndABPkzNrieNuE4PwmSby3sfZBBVPHNbcJE1bcJU-u_DA33_TXzvbNW7ZKu9iRnk92ogwVg9QXDUHJwhR4AZfzHxJeq-mzAAAA&shmds=v1_AdeF8Kj78jWHHc6kVZb1Uz8CinLx29AIBUJR23dd9JZk_WP3aQ&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=new+grad+2026+tech&htidocid=H7fv5djS5ElU1OiJAAAAAA%3D%3D",
    "thumbnail": "https://serpapi.com/searches/691a67d33d0e4e75e6b8c68f/images/866ad4188f00f8880828b3032b3a7250567d94de2f93399e7d2e5365aae70f15.jpeg",
    "extensions": [
      "Full-time"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time"
    },
    "description": "Who We Are\n\nKonrad is a next generation digital consultancy. We are dedicated to solving complex business problems for our global clients with creative and forward-thinking solutions. Our employees enjoy a culture built on innovation and a commitment to creating best-in-class digital products in use by hundreds of millions of consumers around the world. We hire exceptionally smart, analytical, and hard working people who are lifelong learners.\n\nAbout The Role\n\nAs an entry level Software Developer you'll be tasked with working on both mobile and web applications. Working within the software development team, your duties will require you to assist in the development of consumer and enterprise applications. This role is ideal for entry level developers who feel confident in their technical ability and want to be a part of the highly-skilled development team at Konrad. Our graduate program includes an exciting digital training and onboarding program during the first 3 months of employment.\n\nThis cohort will commence on July 7, 2026.\n\nWhat You'll Do\n• Write maintainable, testable, and performant software in collaboration with our world class team\n• Participate in code review and performing extensive testing to ensure high quality software\n• Research new technology and tools and share those findings with the team\n• Communicate clearly and effectively with all members of our team\n\nQualifications\n• Graduated from a Computer Science, Software Engineering, or similar program in a University or College\n• Strong command of important programming and computer science concepts\n• Ability to understand a web application and how it's built from end-to-end\n• Fundamental knowledge of core web principals (HTTP, the DOM, SSL, web servers)\n• Fluency with databases (schema design, querying, optimization etc.)\n• Great interpersonal skills - we work very closely together as a team and require a lot of communication\n• Proactive personality and a desire to deliver your best work.\n\nPerks and Benefits\n• Mentorship Program\n• Socials, Outings & Retreats\n• Culture of Learning & Development\n• Comprehensive Health & Wellness Benefits Package\n• Retirement Planning\n• Flexible Working Hours\n• Work from Home Flexibility\n• Service Recognition Programs\n\nBonus Points\n\nHave you taken any courses at BrainStation? A lot of our design and development best practices and processes are taught during our courses - make sure to highlight this experience in your cover letter if you have!\n\nKonrad is committed to maintaining a diverse work environment and is proud to be an equal opportunity employer. All qualified applicants, regardless of race, colour, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status will receive consideration for employment. If you have any accessibility requirements or concerns regarding the hiring process or employment with us, please notify us so we can provide suitable accommodation.\n\nWhile we sincerely appreciate all applications, only those candidates selected for an interview will be contacted.\n\n#LI-Hybrid",
    "apply_options": [
      {
        "title": "Wellfound",
        "link": "https://wellfound.com/jobs/3428292-software-developer-entry-level-spring-2026-graduate-program?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Indeed",
        "link": "https://ca.indeed.com/viewjob?jk=1346954f8959f616&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "ZipRecruiter",
        "link": "https://www.ziprecruiter.com/c/Konrad/Job/Software-Developer-Entry-Level-(Spring-2026-Graduate-Program)/-in-Toronto,ON?jid=121e1af2241b333b&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Built In",
        "link": "https://builtin.com/job/software-developer-entry-level-spring-2026-graduate-program/7135328?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Glassdoor",
        "link": "https://www.glassdoor.ca/job-listing/software-developer-entry-level-spring-2026-graduate-program-konrad-JV_IC2281069_KO0,59_KE60,66.htm?jl=1009876695902&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Adzuna",
        "link": "https://www.adzuna.ca/details/5475509569?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Workopolis",
        "link": "https://www.workopolis.com/jobsearch/viewjob/MoRl6wF6ZtTRtJyFpHxHGF9PeXy8FliLXitnGz2OmAtgvZylBMbw5mj-8V3dyVNQ?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "SimplyHired",
        "link": "https://www.simplyhired.ca/job/sLSYYG19HaJIbp9b9ZiiFDbxIs015kBGRwON1f16ZRK4pipU90DoAg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      }
    ],
    "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIgRW50cnkgTGV2ZWwgKFNwcmluZyAyMDI2IEdyYWR1YXRlIFByb2dyYW0pIiwiY29tcGFueV9uYW1lIjoiQnJhaW5TdGF0aW9uIiwiYWRkcmVzc19jaXR5IjoiVG9yb250bywgT04iLCJodGlkb2NpZCI6Ikg3ZnY1ZGpTNUVsVTFPaUpBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lXVkc5eWIyNTBieXhQYm5SaGNtbHZMRU5oYm1Ga1lRIiwiZ2wiOiJjYSIsImhsIjoiZW4ifQ=="
  },
  {
    "title": "2026 Graduate Program- Engineering",
    "company_name": "Bell",
    "location": "Barrie, ON",
    "via": "Jobs.ca",
    "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=new+grad+2026+tech&htidocid=XJSz_c4HcOYqOXhhAAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_xXMsQrCQAwAUFw7OjplFtsrBQV1K0jBQf2DktZwd3JNSnJCP8KPVpc3vuKzKo5N3RygU3y-MRM8VLziVMKFfWQijeyhhKsMYIQ6BhCGTsQn2pxDzrOdnDNLlbeMOY7VKJMTpkEW95LB_vQWUGlOv79v9vVSzey365ZSgsjQomqkHdxvXz2d2aqPAAAA&shmds=v1_AdeF8KjG2ZSjqp1FoIaG_A5LH3xZCVUyEa6Hf1wuddnwn2mkUw&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=new+grad+2026+tech&htidocid=XJSz_c4HcOYqOXhhAAAAAA%3D%3D",
    "extensions": [
      "19 days ago",
      "Full-time"
    ],
    "detected_extensions": {
      "posted_at": "19 days ago",
      "schedule_type": "Full-time"
    },
    "description": "**Req Id:\n• *425827****\nAt Bell, our purpose is to advance how Canadians connect with each other and the world. We achieve this by providing consumers and businesses with the best network technologies in the world, innovative digital solutions and seamless customer experiences. It’s all developed and delivered by the members of #TeamBell and we’re always on the lookout for people with great skills and experiences.\n\nWe provide a supportive and inclusive community where all team members can succeed. And through our commitment to environmental, social and governance initiatives, you will feel good about the greater impact you will have – making every day better for people as they connect, work, learn and play.\n\nJoin us. You belong at Bell.\n\nLaunch your career at Bell and join the best-in-class Internship/Graduate Program. You’ll be empowered to shape your future and inspired to bring your best ideas to work. Throughout the program, you’ll have the chance to connect with mentors and senior leaders who will support your professional and personal growth journey. You’ll develop real-world skills and join other interns and grads attending exclusive events and networking opportunities.\n\nAt Bell, innovation drives us. With advanced tech, AI tools, and a collaborative culture, you’ll shape the future and grow your career. Join us!\n\nThis application is specifically for the Graduate program. Please ensure you are eligible to the program as specified on the Students & Graduates website.\n• *Why join us?**\n\n- Benefit from a continuous learning environment including formal and experiential training and development opportunities to help you excel in your roles.\n- Deliver on transformational projects to launch new product roadmaps, services, and solutions, to enable customers to do more.\n- Refine your analytical, project management, and communication skills with hands-on, real-world experiences to fast-track your career.\n- Learn from a supportive Executive Team and be mentored by experienced #TeamBell leaders.\n- Expand your network as you work with the industry experts, including our amazing peer-to-peer grad and alumni support network.\n• *What You’ll Do**\nLaunch your career as a graduate in the Engineering team where you will be making an impact on some of our most critical assets. Daily, you will have the opportunity to be hands-on at Bell, working on project management and agile methodologies in a construction environment. Engineering also includes important work in network architecture focused on radio communications or supporting our B2B clients, network architectures, data analytics, and cloud technologies or design and wireless systems.\n\nUpon completion of the program, you will have the knowledge, skills, network, and breadth of experience to help transform the organization and become the next generation of leaders at Bell.\n• *What We’re Looking For**\nWithin our Engineering function, we have several opportunities available. For more details on each of the below roles, click here.\n\n- Network Engineering\n- Network Architecture\n- Network Provisioning\n- Technology Specialist\n• *Requirements**\n\n- You have a bachelor's or master's degree in engineering (Electrical, Civil, Industrial, Mechanical), Engineering Science/Physics, Computer Science or related field (if you believe you are up for the challenge with a different degree/diploma, you are welcome to apply)\n- You have a desire to expand your knowledge in any of the following fields:\n- Project management and Agile methodologies in a construction environment\n- Network architecture and design (hardware and software), routing protocols and principles\n- Broadcast, data center and/or cloud technologies\n- Radio communications and/or wireless systems\n- A valid driver's license or equivalent might be required.\n• *Technical Skills (you Have Some Of The Following)**\n\n- You are proficient in Teldig and Cognibox (applicable for Access Network Engineering roles).\n- You have excellent knowledge of MS Excel.\n- You have knowledge of Agile methodologies.\n- You have knowledge of Python programming (object-oriented programming).\n- Your technical acumen includes Cloud containers and Broadcast knowledge (applicable for Architecture & Engineering role).\n- You are familiar with construction drawings and structural analysis (if applicable).\n- You have a solid understanding of building materials, construction regulations and quality standards.\n• *Leadership Skills**\n\n- You are a skilled communicator balancing urgency, empathy and integrity. You speak and write clearly and concisely, and you listen with the purpose of encouraging transparent dialogue.\n- You gain the trust of your teams, being known for demonstrating fairness and respect.\n- You promote belonging and are flexible, accountable and collaborative.\n- You are analytical and are an exceptional problem-solver with a curiosity to understand \"how things work”.\n- You can identify insights and opportunities from data and metrics and are able to create strategies to support sound recommendations.\n- You can simplify complex issues, make good and timely decisions, and be an accountable member of a team.\n- You are willing to challenge the status quo, experimenting to find solutions that will make a difference in the lives of Bell’s customers.\n- You are goal-oriented and can focus on individual tasks while also understanding the bigger picture and how systems work together.\n- You are committed to growing your skills and learning from others.\n- Your leadership qualities have been demonstrated through extracurricular activities and projects.\n• *Applying is simple**\nOur application process is designed to be straightforward, so you can show us who you are and we can easily spot your #TeamBell potential.\n\n- Review our programs and indicate up to three role choices in your application.\n- Complete your video interview within 72 hours.\n- If selected, you will be invited to complete a phone interview or assessment to better understand your skills and experience.\n- If selected from previous step, you will be invited to a virtual panel interview.\n\nGet started by clicking\n• *Apply**\non this page. Submit a resume, and most recent transcripts (unofficial accepted) to be considered.\n\nOffers will be made to qualified interns ongoing from October 2025 to February 2026 or until all positions are filled.\n\nAdequate knowledge of French is required for positions in Quebec.\n\n#CampusEng\n• *Additional Information**\n• *Position Type:**\nManagement\n• *Job Status:**\nGrad Hire\n• *Job Location:**\nCanada : Ontario : Sudbury || Canada : New Brunswick : Moncton || Canada : Newfoundland : St. John's || Canada : Nova Scotia : Halifax || Canada : Ontario : Barrie || Canada : Ontario : London || Canada : Ontario : Mississauga || Canada : Ontario : Toronto || Canada : Quebec : Montreal || Canada : Quebec : Quebec City\n• *Work Arrangement:**\nHybrid\n• *Application Deadline:**\n11/09/2025\n\nFor work arrangements that are ‘Hybrid’, successful candidates must be based in Canada and report to a set Bell office for a minimum of 3 days a week. Recognizing the importance of work-life balance, Bell offers flexibility in work hours based on the business needs.\n• *Please apply directly online to be considered for this role. Applications through email will not be accepted.**\nWe know that caring for our team members is at the heart of a healthy, positive and thriving workplace. As part of our team, you’ll enjoy a comprehensive compensation package that includes a competitive salary and a wide range of benefits to support the well-being of you and your family. As soon as you join us, you'll be eligible for medical, dental, vision and mental health benefits that you can tailor to your specific needs. Plus, as a Bell team member, you'll enjoy a 35% discount on our services and access exclusive offers from our partners.\n\nAt Bell, we are proud of our focus on fostering an inclusive and accessible workplace where all team members feel valued, respected, supported, and that they belong.\n\nWe also want to make sure that everyone has an equal opportunity to join our team. We encourage individuals who may require accommodations during the hiring process to let us know. For a confidential inquiry, email your recruiter or recruitment@bell.ca to make arrangements. If you have questions or feedback regarding accessibility at Bell, we invite you to complete the Accessibility feedback form or visit our Accessibility page for other ways to contact us.\n\nArtificial intelligence may be used to assess parts of your application. Please review our privacy policy (see Phenom for details) to learn more about how we collect, use, and disclose your personal information.\n\nCreated: Canada, ON, Mississauga\n• *Bell, one of Canada's Top 100 Employers.**",
    "apply_options": [
      {
        "title": "Jobs.ca",
        "link": "https://www.jobs.ca/job/481c619a-036a-4170-bffe-7f6de2280fae?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "BeBee CA",
        "link": "https://ca.bebee.com/job/9be237a3ec162b74d2972682859e7678?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "PMjobs.ca",
        "link": "https://www.pmjobs.ca/job/481c619a-036a-4170-bffe-7f6de2280fae?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Jobs Trabajo.org",
        "link": "https://ca.trabajo.org/job-3804-3fe7daba8164008c06d0411efac00c0c?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      }
    ],
    "job_id": "eyJqb2JfdGl0bGUiOiIyMDI2IEdyYWR1YXRlIFByb2dyYW0tIEVuZ2luZWVyaW5nIiwiY29tcGFueV9uYW1lIjoiQmVsbCIsImFkZHJlc3NfY2l0eSI6IkJhcnJpZSwgT04iLCJodGlkb2NpZCI6IlhKU3pfYzRIY09ZcU9YaGhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lXVkc5eWIyNTBieXhQYm5SaGNtbHZMRU5oYm1Ga1lRIiwiZ2wiOiJjYSIsImhsIjoiZW4ifQ=="
  },
  {
    "title": "New Grad Program - Environmental Services (Earth Sciences) -Toronto, ON - June 2026 Start",
    "company_name": "Hydro One",
    "location": "Toronto, ON",
    "via": "Jooble",
    "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=new+grad+2026+tech&htidocid=5I-FqxqcgzGixv25AAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_02NsQrCQBBEsc0XiNWWKiaRgBZaS8QiEWIvl3NJTpLdsLdG_UT_yrOzGZjhDS_6TKKhwCfkYm5wFm7E9BDDgUYnTD2Smg4qlNFZ9DA_GNEWKuuQQl9AfOGAKa-gLMLt9CCEbJ1todJA_hauwaMR2wIT5MxNh7N9qzr4XZp63yWNV6POJpb7lAlrfqV3rv0vrr41gkNnFK_ZZv1KBmqW0-P7JgxlMDmCP_8XDtaSJcwAAAA&shmds=v1_AdeF8KjlYVX5WnVV-mTA-wDp5WnBEamPdZ0oMWh1yNwooE9_Dg&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=new+grad+2026+tech&htidocid=5I-FqxqcgzGixv25AAAAAA%3D%3D",
    "thumbnail": "https://serpapi.com/searches/691a67d33d0e4e75e6b8c68f/images/866ad4188f00f888b229642f2ab7509febe1ded798e18da25f69d5abf1fd5788.png",
    "extensions": [
      "Full-time"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time"
    },
    "description": "Apply now\n\nDate: Oct 9, 2025\n\nLocation: Toronto, ON, CA\n\nCompany: Hydro One Networks Inc\n\n50822 - Toronto - Regular Not Applicable/Optional\n\nHydro One is proud to be the largest electricity transmission and distribution provider in Ontario, serving nearly 1.5 million customers. We have a long history in the industry with our roots dating back over 110 years to 1906. Since then, we have worked to grow and evolve to meet the changing needs of our customers and communities across Ontario. Today, we’re focused on providing exceptional customer service and ensuring we are building safe communities where we live, work and play.\n\nIt’s an exciting time to join the team at Hydro One!\nNew Grad Program\nCandidates selected for this position will be included in Hydro One's New Grad development program.\n\nOur New Graduate program reflects our long-term commitment to invest time and resources to build the best and brightest team. We are always on the lookout for individuals who have a passion for learning and are looking to build their career with Hydro One.\n\nThe two-year program offers a permanent position from Day 1, a combination of training and coaching, and the ability to rotate through several roles allowing New Grads to gain experience working on different projects and in different environments.\n\nProgram Eligibility\n• You have graduated with your bachelor's degree in 2024, 2025 or will graduate by May 2026\n• Or, you are currently completing a master's degree in a related field, you are graduating by May 2026, and have a maximum of 1 year between completing your bachelor's degree and enrolling in your master's program.\n• Good Academic Standing (A copy of your Official/Unofficial Transcript)\n• Valid, permanent driver's license (Ontario Class G)\nEnvironmental Services We are seeking 1 New Grad within our Environmental Services team with a focus on earth sciences/Engineering- soil and groundwater.\n\nThis role will report to the Manager or Supervisor of Environmental Services. The position will focus on managing geo-environmental studies for Hydro One construction projects as part of the Geo-Environmental Team. As well as supporting emergency spill response Team.\n\nThe position requires knowledge and experience in planning and implementing environmental site assessments, geotechnical investigations, hydrogeological investigations, remediation and excess soil management throughout the province of Ontario.\n\nGeneral Accountabilities:\n• Treat Safety as a Priority\n• Develop and track environmental work plans, budget estimates and schedules.\n• Develop contract specifications/RFP/scope of work requests, evaluate proposals, award and administer consultant contracts for environmental services, for geotechnical investigations, Phase I and 2 Environmental Site Assessments, Remediations, Designated Substances Surveys, permitting, and monitoring services.\n• Identify and compare environmental constraints, alternatives, assess potential environmental effects and mitigation measures.\n• Conduct site visits, evaluation of features and issues, assess environmental effects and prepare environmental protection plans for construction.\n• Review Contractor Environmental Management Plans\n• Monitor environmental aspects of stations and lines capital projects in the field.\n• Document, organize and file project information appropriately within existing systems including Borealis consultation software, Commitment Layer of GIS, and in SharePoint.\n• Provide advice, guidance, and assistance to project and asset managers responsible for new transmission and distribution projects and refurbishment of existing facilities regarding environmental aspects, applicable legislation and guidelines, including corporate policies and procedures.\n• Prepare and present technical and organizational information to internal or external groups.\n• Perform other duties as required.\nWhat we look for:\n• Knowledge and experience in environmental planning, coordinating and conducting environmental studies, implementing environmental site assessments, geotechnical investigations, hydrogeological investigations, remediation and excess soil management through the province of Ontario\n• Requires a strong understanding of natural environment features and ecosystems to allow for timely, appropriate, and compliant environmental planning and implementation of environmental mitigation plans for construction.\n• Understanding of environmental issues and legislative requirements (Reg. 153/04, Site Assessment Reg.406- Excess Soil Management, Environmental Protection Act, Provincial Policy Statement, Ontario Water Resources Act, other environmental legislation).\n• Understanding of soil and groundwater assessment, site remediation and assessment / mitigation of Designated Substances.\n• Experience working with regulatory agencies, Indigenous communities and members of the public.\n• Demonstrated knowledge and experience in ArcGIS or mapping software.\n• Ability to tender and monitor environmental consultant contracts.\n• Ability to navigate uneven terrain, walking longer distances and working outside during inclement weather may be required.\n• Ability to independently travel to local or remote sites, communicate with construction or other stakeholders and evaluate situations and develop/implement mitigation plans.\n• Strong technical writing for preparation of environmental management reports, manuals, specifications and tender documents.\n• Demonstrated knowledge and experience with Windows software (MS Word, Excel, Outlook and PowerPoint).\n• Requires a high level of initiative, strong communication skills and interpersonal skills.\n• Strong team player and good interpersonal skills.\n• Ability to work on multiple projects with strong organizational and time management skills.\n• Proficiency in written and spoken English to communicate effectively with internal and external stakeholders and prepare technical reports.\n• Demonstrated ability to work under minimal supervision.\n• Ability to assimilate new tasks/information quickly and apply the skills to various situations.\n• Ability to understand the implications of business decisions and the ability to strive to improve organizational performance.\n• Flexibility and adaptability regarding changes to the work.\nJob Requirements:\n• Four-year university degree in environmental science, engineering, Environmental studies, natural sciences or a related field. Focus on soil and groundwater contamination and cleanup.\n• Project locations are expected to be throughout Ontario. Role will require overnight absences from home from time to time for site visits and meetings and may require travel throughout Ontario\n• Valid Ontario driver’s license\n\nHow to Apply:\nIf you share our passion for safety, our customer service focus, and are ready to play a lead role in building a bright future, we would love to hear from you!\n\nDocuments to Include (Mandatory):\n• Resume\n• A copy of your most recent Transcript (Official/Unofficial)\nDeadline: October 28 2025\n\nWe thank all applicants for their interest in a career at Hydro One; however, only those candidates who are selected for an interview will be contacted.\n\nTell Us About You\nAs part of our commitment to building a thoughtful and values-driven team, we encourage you to create your application materials—such as your resume, cover letter, and any written or oral responses—without the use of AI tools.\n\nWe’re genuinely interested in hearing your story, in your own words. Your personal voice, experiences, and perspective help us understand how you might contribute to our team and culture.\n\nThank you for taking the time to share your authentic self with us.\n\nAccommodations\nAt Hydro One we understand that the success and strength of our business rests with our people. When we develop their skills, we are investing in both their success and ours. To secure the best talent, we seek to create a workforce that reflects the diverse populations of the communities where we live and work and to create a culture based on safety, innovation and inclusiveness.\n\nIf you need an accommodation due to a disability, please email View email address on ca.snapjobsearch.com. Hydro One will provide reasonable accommodations for qualified individuals with disabilities in the job application process.\n\nPlease note this email is only for accommodation requests. Resumes sent to this email address will not be considered.\n\nWe are honored to be recognized by Forbes in its list of Canada’s Best Employers for 2025. \"Employer of the year 2025\"\n\nJob Segment: Geology, GIS, Law, Pre-Sales, RFP, Engineering, Sales, Technology, Legal\nApply now",
    "apply_options": [
      {
        "title": "Jooble",
        "link": "https://ca.jooble.org/jdp/617072261169690805?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "BeBee CA",
        "link": "https://ca.bebee.com/job/8a42deda43c409de07c4622d9750d23f?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      }
    ],
    "job_id": "eyJqb2JfdGl0bGUiOiJOZXcgR3JhZCBQcm9ncmFtIC0gRW52aXJvbm1lbnRhbCBTZXJ2aWNlcyAoRWFydGggU2NpZW5jZXMpIC1Ub3JvbnRvLCBPTiAtIEp1bmUgMjAyNiBTdGFydCIsImNvbXBhbnlfbmFtZSI6Ikh5ZHJvIE9uZSIsImFkZHJlc3NfY2l0eSI6IlRvcm9udG8sIE9OIiwiaHRpZG9jaWQiOiI1SS1GcXhxY2d6R2l4djI1QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJV1ZHOXliMjUwYnl4UGJuUmhjbWx2TEVOaGJtRmtZUSIsImdsIjoiY2EiLCJobCI6ImVuIn0="
  },
  {
    "title": "Associate, Strategy Analyst - New Grad 2026",
    "company_name": "Capital One",
    "location": "Toronto, ON",
    "via": "Ladders",
    "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=new+grad+2026+tech&htidocid=HljLvoB_gufYSxjgAAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_xWNsQ6CMBBA48onMN1skBISHXRCBxIHGHQnR21KSe01vUuEj_FfxeW9vOll3112bZhJOxRTwEPSZrtCE9CvLHCAznygTfiCuqpPW99pBDaY9AQUoCWy3uSXSSTyWSlmX1oWFKdLTW9FwYy0qJlG_mPgCZOJfpsM9bFayhjsPr9hdIIe-mDABXhSoiBUQN_9AO1hnBGgAAAA&shmds=v1_AdeF8KjzfnuCJYEpdR2z0HqKIFOrp7Tribg7LW-AXORy_XFzXw&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=new+grad+2026+tech&htidocid=HljLvoB_gufYSxjgAAAAAA%3D%3D",
    "thumbnail": "https://serpapi.com/searches/691a67d33d0e4e75e6b8c68f/images/866ad4188f00f8887da2ea95e95b728e9b3ac3cb0f1e2ad99f61d5d35562057c.png",
    "extensions": [
      "US$98K a year",
      "Full-time"
    ],
    "detected_extensions": {
      "salary": "US$98K a year",
      "schedule_type": "Full-time"
    },
    "description": "161 Bay Street (93021), Canada, Toronto,Toronto, Ontario,\n\nAssociate, Strategy Analyst - New Grad 2026\n\nAbout Capital One Canada.\n\nFor over 20 years, we've been on a mission to change banking for good and build relationships by making credit accessible, simple, intuitive and rewarding. We want to help Canadians succeed with credit, because we believe in people - in our customers, in our associates, and in talent like you!\n\nOur Capital One Strategic Analytics Team\n\nYes, we're a credit card company. But we're more than that too. We're driven by what our customers want, and how to make their lives simpler.\n\nWe're always looking for creative ways to offer digital solutions that make sense for our customers. With your help, we'll build the next generation of banking in Canada based on customer-focused values, compelling products and great engineering.\n\nWorking with us\nHow do we do things at Capital One Canada? We listen - to our people, and to our customers. We change with the times and have adopted a flexible hybrid model (remote and/or in-office). Associates working in the hybrid model are expected to come into the office 3 days a week across Tuesdays and Thursdays, reserving Mondays and Fridays as company-wide virtual days. As was true before the pandemic, expectations of being in the office will be balanced with personal life flexibility.\n\nAt Capital One we're committed to diversity, inclusion and belonging. We strive to build a culture where diverse perspectives are valued, innovative ideas are encouraged and inclusive behaviours are embedded in everything we do to positively impact associates. Strive to build a culture where diverse perspectives are valued, innovative ideas are encouraged and to help challenge the status quo and create the best outcomes for everyone.\n\nWe're focused on helping associates live well-physically, financially and emotionally. When you join us, we support you and those who are most important to you, offering full coverage for spouses, domestic partners, and dependents. We've designed our benefits program to be flexible, comprehensive and consistent across our organization. From health and fitness center discounts, to training and professional development programs-and much more-you'll discover that Capital One is committed to helping you live your best life.\n\nCapital One Canada is an equal opportunity employer committed to fostering a diverse and inclusive work environment. We consider all qualified applicants and will meet the needs of those requiring reasonable accommodations.\n\nA day in the life of a Capital One Strategy Analyst\n\nAs a Strategy Analyst, you'll develop and apply analytical rigour, problem solving skills and critical thinking from day one. Embedded within a cross-functional team, you'll bring your strategies to life from conception and analytical business case building to in-market delivery, measuring their impact through testing and monitoring, and ultimately being accountable for both customer and financial outcomes. You'll spend time gathering and visualizing data, storytelling through presentations, collaborating with experts in areas like legal and technology, and influencing senior leadership on critical decisions.\n\nYou'll work with tools like SQL to query data, use spreadsheets and Python-based notebooks to organize it, and slides to present it, along with a number of other modern analytics tools. Working in an agile, cross-functional team you'll also have the opportunity to learn from other job families like data scientists, process managers, and product owners.\n\nOur strategy analysts are deployed across all areas of our business - product design, fraud, customer acquisitions, customer management strategy, and more - and analysts over time get the opportunity to rotate to different areas of the business to help them build a well rounded understanding of our business. Here are a few of the ways our Strategy Analysts are helping people take control of their credit:\n• Underwriting (Credit Policy & Valuations): Strategy Analysts are responsible for assisting in developing & maintaining statistical models and the associated credit policies that help us determine who we extend credit to. Analysts in the space perform analysis on credit performance to help influence how we update and optimize our models & policies.\n• Fraud: Strategy Analysts are responsible for developing the defences and policies to mitigate fraud losses for Capital One, creating a safe and secure experience for our customers. Analysts in the space perform diligent monitoring to understand emerging fraud trends and propose actions to prevent fraudulent behaviour.\n• Product Development: Strategy Analysts are responsible for developing the strategies to test and scale new financial product offerings. Analysts conduct market & customer research, and couple these insights with internal data modeling to propose new solutions for our customers. Analysts in this space work with process and technology experts to get new products in the hands of our customers, and iterate upon our offerings based on consumer reception.\n\nAs a new Strategy Analyst, you'll join the Canada Analyst Development Program (CADP), which takes place over your first year with us and involves hands-on training, a case competition, social and networking events, and more.\n\nResponsibilities\n\nYou will get to work with a team of fellow strategy analysts, along with associates in other job families such as Data Scientists and Product Managers, working to execute on and accomplish the following:\n• Perform modeling/analytics to assist new product and pricing strategies for various lending products.\n• Develop direct-to-consumer marketing strategy and initiatives to support business growth objectives.\n• Help build targeted insights to inform the design and development of new customer experiences, as well as breakthrough technology and concepts designed to deliver on new go to market strategies.\n• Support step-change improvements in credit performance by connecting drivers of future consumer credit trends to historical behaviour, creating risk models, and testing hypotheses using rigorous monitoring and analysis.\n\nBasic Qualifications\n• Graduate in 2026 with a Master's or Bachelor's Degree in Commerce, Finance, Marketing, Economics, Business Administration, Engineering, Mathematics, Statistics or a related field\n\nPreferred Qualifications\n• Experience in basic coding and/or data visualization (e.g. SQL, Python, Tableau, QuickSight). If you know how to build models or write code, that's awesome. If not, don't worry as long as you have an interest in and aptitude for learning it.\n• Experience in analytical problem-solving.\n\nWorking at Capital One.\n\nEnjoy a hybrid work environment, with 3 days in the office. Build a comfortable workspace with our one-time, Work From Home allowance and enjoy our head office located conveniently across the street from Union Station.\n\nLive well-physically, financially and emotionally. Receive support for you and those who are most important to you, with full coverage for spouses, domestic partners, and dependents. With up to $3000 in mental health coverage and up to $5000 in tuition subsidies per year-and much more-you'll discover that Capital One is committed to helping you live your best life.\n\nCapital One Canada is an equal opportunity employer committed to fostering a diverse and inclusive work environment. We consider all qualified applicants and will meet the needs of those requiring reasonable accommodations.\n\nAt Capital One Canada, paying our employees fairly is fundamental to our core values of Excellence and Do the Right Thing. We are committed to being intentional and fair in how we set pay across our organization. The salary for this position is $98,000 per annum.\n\nCapital One Canada is an equal opportunity employer committed to fostering a diverse and inclusive work environment. We consider all qualified applicants and will meet the needs of those requiring reasonable accommodations.\n\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1-800-304-9102 or via email at ARCanada@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\n\nCapital One does not provide, endorse nor guarantee and is not liable for third-party products, services, educational tools or other information available through this site.\n\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).",
    "apply_options": [
      {
        "title": "Ladders",
        "link": "https://www.theladders.com/job/associate-strategy-analyst-new-grad-2026-capitalonefinancialcorporation-toronto-on_82832658?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Jobs.weekday.works",
        "link": "https://jobs.weekday.works/capital-one-associate%2C-process-management--new-grad-2026?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Jobs Trabajo.org",
        "link": "https://ca.trabajo.org/job-3385-3a413d2f65ffc9d900ef1b9a2fdf5d66?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      }
    ],
    "job_id": "eyJqb2JfdGl0bGUiOiJBc3NvY2lhdGUsIFN0cmF0ZWd5IEFuYWx5c3QgLSBOZXcgR3JhZCAyMDI2IiwiY29tcGFueV9uYW1lIjoiQ2FwaXRhbCBPbmUiLCJhZGRyZXNzX2NpdHkiOiJUb3JvbnRvLCBPTiIsImh0aWRvY2lkIjoiSGxqTHZvQl9ndWZZU3hqZ0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSVdWRzl5YjI1MGJ5eFBiblJoY21sdkxFTmhibUZrWVEiLCJnbCI6ImNhIiwiaGwiOiJlbiJ9"
  }
]